Revit 2027 API
BuiltInFailures.ImportFailures.FailedToSetWorkplane Property
 Could not set Work Plane of [Import].\n\nPlease use the Work Plane tool to set a Work Plane for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedToSetWorkplane { get; }
Public Shared ReadOnly Property FailedToSetWorkplane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedToSetWorkplane {
	FailureDefinitionId^ get ();
}
static member FailedToSetWorkplane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace